In [17]:
import pandas as pd

In [18]:
ratings = pd.read_csv('./title.ratings.tsv',  sep='\t', header=0)

In [19]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.8      1351
1  tt0000002            6.5       157
2  tt0000003            6.6       939
3  tt0000004            6.4        93
4  tt0000005            6.2      1623

In [20]:
ratings.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [21]:
ratings.shape

(811998, 3)

In [22]:
crew = pd.read_csv('./title.crew.tsv',  sep='\t', header=0)

In [23]:
crew.head()

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

(4858917, 3)

In [25]:
principals = pd.read_csv('./title.principals.tsv',  sep='\t', header=0)

In [26]:
principals.head()

,tconst,ordering,nconst,category,job,characters
0,tt0000001,1,nm1588970,self,\N,"[""Herself""]"
1,tt0000001,2,nm0005690,director,\N,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N
3,tt0000002,1,nm0721526,director,\N,\N
4,tt0000002,2,nm1335271,composer,\N,\N

In [27]:
principals.shape

(27345586, 6)

In [28]:
princ_and_crew = principals.merge(crew, how='inner', on='tconst' )

In [29]:
princ_and_crew.head()

,tconst,ordering,nconst,category,job,characters,directors,writers
0,tt0000001,1,nm1588970,self,\N,"[""Herself""]",nm0005690,\N
1,tt0000001,2,nm0005690,director,\N,\N,nm0005690,\N
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N,nm0005690,\N
3,tt0000002,1,nm0721526,director,\N,\N,nm0721526,\N
4,tt0000002,2,nm1335271,composer,\N,\N,nm0721526,\N

In [30]:
imdb_df = princ_and_crew.merge(ratings, how='inner', on='tconst')

,tconst,ordering,nconst,category,job,characters,directors,writers,averageRating,numVotes
0,tt0000001,1,nm1588970,self,\N,"[""Herself""]",nm0005690,\N,5.8,1351
1,tt0000001,2,nm0005690,director,\N,\N,nm0005690,\N,5.8,1351
2,tt0000001,3,nm0374658,cinematographer,director of photography,\N,nm0005690,\N,5.8,1351
3,tt0000002,1,nm0721526,director,\N,\N,nm0721526,\N,6.5,157
4,tt0000002,2,nm1335271,composer,\N,\N,nm0721526,\N,6.5,157

In [33]:
imdb_df.shape

(6846032, 10)

In [37]:
imdb_df.to_csv("imdb_test",chunksize=500000, mode='a')

NameError: name 'imdb_df' is not defined